package fan;

//--------------------------------------------------------------------------------
//扇風機の風量にかかわるクラス「Blade」
//--------------------------------------------------------------------------------
public class Blade {



	//----------------------------------------------------------------------------
	//  風量を保持するフィールド
	//----------------------------------------------------------------------------
	private  static int wind;

	//フィールドの初期化（風量＝0）
	static{
		wind = 0;
	}



	//----------------------------------------------------------------------------
	//  風量を取得するメソッド
	//----------------------------------------------------------------------------
	public int getWind () {

		return wind;
	}



	//----------------------------------------------------------------------------
	//  風量をサイクリックに変更するメソッド
	//----------------------------------------------------------------------------
	public void changeWind() {

		Power power1 = new Power ();

		//電源状態の取得をし、分岐処理
		if(power1.getPower()){

			//電源ONの場合
			switch(getWind()){

			//風量中で稼働を開始（電源ONの処理）
			case 0:
				wind = 2;
				System.out.println("風量中で稼働を開始します。");
				break;

			//現在風量弱のため、中に変更
			case 1:
				wind = 2;
				System.out.println("風量が中になりました。");
				break;

			//現在風量中のため、強に変更
			case 2:
				wind = 3;
				System.out.println("風量が強になりました。");
				break;

			//現在風量強のため、弱に変更
			case 3:
				wind = 1;
				System.out.println("風量が弱になりました。");
				break;
			}

		//電源OFFのため、羽根を停止
		}else {
			wind = 0;
		}

	}
}
