package fan;

//--------------------------------------------------------------------------------
//扇風機の電源を管理するクラス「Power」
//--------------------------------------------------------------------------------
public class Power {



//----------------------------------------------------------------------------
//  扇風機の電源状態を保持するフィールド（初期値false）
//----------------------------------------------------------------------------
private static boolean pow;


//  初期化（電源＝false）
static{
	pow = false;
}



//----------------------------------------------------------------------------
//  電源状態を取得するメソッド
//----------------------------------------------------------------------------
public boolean getPower() {

	return pow;
}



//----------------------------------------------------------------------------
//  電源状態を変更するメソッド
//----------------------------------------------------------------------------
public void changePower() {

	Blade blade1 = new Blade ();

	Timer timer1 = new Timer ();

	//電源状態の取得をし、分岐処理
	//電源ONの場合電源OFF処理
	if(getPower()){
		pow = false;
		System.out.println("電源がOFFになりました");
		//風量停止
		blade1.changeWind();


	//電源OFFの場合電源ON処理
	}else {
		pow = true;
		System.out.println("電源がONになりました");
		//風量中で稼働
		blade1.changeWind();

	}

	//タイマーをOFFに変更
	timer1.changeTimer();

}
}
